<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="LanmanWorkstation" namespace="Microsoft.Policies.LanmanWorkstation" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <resources minRequiredRevision="1.0" />
  <supportedOn>
    <definitions>
      <!--At least Windows Server 2022 or Windows 11-->
      <definition name="SUPPORTED_Windows_Server_2022_Windows_11_0" displayName="$(string.SUPPORTED_Windows_Server_2022_Windows_11_0)">
      </definition>
      <!--At least Windows Server 2025 or Windows 11-->
      <definition name="SUPPORTED_Windows_Server_2025_Windows_11_0" displayName="$(string.SUPPORTED_Windows_Server_2025_Windows_11_0)">
      </definition>
    </definitions>
  </supportedOn>
  <categories>
    <category name="Cat_LanmanWorkstation" displayName="$(string.Cat_LanmanWorkstation)">
      <parentCategory ref="windows:Network" />
    </category>
  </categories>
  <policies>
    <policy
        class="Machine"
        displayName="$(string.Pol_CipherSuiteOrder_Name)"
        explainText="$(string.Pol_CipherSuiteOrder_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_CipherSuiteOrder"
        presentation="$(presentation.Pol_CipherSuiteOrder)"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="windows:SUPPORTED_Windows_10_0" />
      <elements>
        <multiText
            id="MultiText_CipherSuiteOrder"
            valueName="CipherSuiteOrder"
            />
      </elements>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_EnableInsecureGuestLogons_Name)"
        explainText="$(string.Pol_EnableInsecureGuestLogons_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_EnableInsecureGuestLogons"
        valueName="AllowInsecureGuestAuth"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="windows:SUPPORTED_Windows_10_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_EnableCSCforCAShares_Name)"
        explainText="$(string.Pol_EnableCSCforCAShares_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_EnableOfflineFilesforCAShares"
        valueName="AllowOfflineFilesforCAShares"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="windows:SUPPORTED_Windows_10_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_EnableHandleCachingForCAFiles_Name)"
        explainText="$(string.Pol_EnableHandleCachingForCAFiles_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_EnableHandleCachingForCAFiles"
        valueName="EnableHandleCachingForCAFiles"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="windows:SUPPORTED_Windows_10_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_EnableCompressedTraffic_Name)"
        explainText="$(string.Pol_EnableCompressedTraffic_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_EnableCompressedTraffic"
        valueName="EnableCompressedTraffic"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2022_Windows_11_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_DisableCompression_Name)"
        explainText="$(string.Pol_DisableCompression_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_DisableCompression"
        valueName="DisableCompression"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2022_Windows_11_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy 
        class="Machine"
        displayName="$(string.Pol_MaxSmb2Dialect_Name)"
        explainText="$(string.Pol_MaxSmb2Dialect_Help)"
        presentation="$(presentation.Pol_MaxSmb2Dialect)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_MaxSmb2Dialect"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <elements>
        <enum id="MaxSmb2Dialect" valueName="MaxSmb2Dialect" required="true">
          <item displayName="$(string.Dialect_0x311)">
            <value>
              <decimal value="785" />
            </value>
          </item>
          <item displayName="$(string.Dialect_0x302)">
            <value>
              <decimal value="770" />
            </value>
          </item>
          <item displayName="$(string.Dialect_0x300)">
            <value>
              <decimal value="768" />
            </value>
          </item>
          <item displayName="$(string.Dialect_0x210)">
            <value>
              <decimal value="528" />
            </value>
          </item>
          <item displayName="$(string.Dialect_0x202)">
            <value>
              <decimal value="514" />
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_MinSmb2Dialect_Name)"
        explainText="$(string.Pol_MinSmb2Dialect_Help)"
        presentation="$(presentation.Pol_MinSmb2Dialect)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_MinSmb2Dialect"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <elements>
        <enum id="MinSmb2Dialect" valueName="MinSmb2Dialect" required="true">
          <item displayName="$(string.Dialect_0x202)">
            <value>
              <decimal value="514" />
            </value>
          </item>
          <item displayName="$(string.Dialect_0x210)">
            <value>
              <decimal value="528" />
            </value>
          </item>
          <item displayName="$(string.Dialect_0x300)">
            <value>
              <decimal value="768" />
            </value>
          </item>
          <item displayName="$(string.Dialect_0x302)">
            <value>
              <decimal value="770" />
            </value>
          </item>
          <item displayName="$(string.Dialect_0x311)">
            <value>
              <decimal value="785" />
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_BlockNTLM_Name)"
        explainText="$(string.Pol_BlockNTLM_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_BlockNTLM"
        valueName="BlockNTLM"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_BlockNTLMServerExceptionList_Name)"
        explainText="$(string.Pol_BlockNTLMServerExceptionList_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_BlockNTLMServerExceptionList"
        presentation="$(presentation.Pol_BlockNTLMServerExceptionList)"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <elements>
        <multiText
            id="MultiText_BlockNTLMServerExceptionList"
            valueName="BlockNTLMServerExceptionList"
            />
      </elements>
    </policy>
    <policy 
        class="Machine"
        displayName="$(string.Pol_EnableRemoteMailslots_Name)"
        explainText="$(string.Pol_EnableRemoteMailslots_Help)"
        key="Software\Policies\Microsoft\Windows\NetworkProvider"
        name="Pol_EnableMailslots"
        valueName="EnableMailslots"
        >
      <parentCategory ref="Cat_LanmanWorkstation" />
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_RequireEncryption_Name)"
        explainText="$(string.Pol_RequireEncryption_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_RequireEncryption"
        valueName="RequireEncryption"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2022_Windows_11_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_EnableAlternativePorts_Name)"
        explainText="$(string.Pol_EnableAlternativePorts_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_EnableAlternativePorts"
        valueName="EnableAlternativePorts"
        >
      <parentCategory ref="Cat_LanmanWorkstation" />
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_AuditServerDoesNotSupportEncryption_Name)"
        explainText="$(string.Pol_AuditServerDoesNotSupportEncryption_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_AuditServerDoesNotSupportEncryption"
        valueName="AuditServerDoesNotSupportEncryption"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_AuditServerDoesNotSupportSigning_Name)"
        explainText="$(string.Pol_AuditServerDoesNotSupportSigning_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_AuditServerDoesNotSupportSigning"
        valueName="AuditServerDoesNotSupportSigning"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_AuditInsecureGuestLogon_Name)"
        explainText="$(string.Pol_AuditInsecureGuestLogon_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_AuditInsecureGuestLogon"
        valueName="AuditInsecureGuestLogon"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_AlternativePortMappings_Name)"
        explainText="$(string.Pol_AlternativePortMappings_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_AlternativePortMappings"
        presentation="$(presentation.Pol_AlternativePortMappings)"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <elements>
        <multiText
            id="MultiText_AlternativePortMappings"
            valueName="AlternativePortMappings"
            />
      </elements>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_EnableSMBQUIC_Name)"
        explainText="$(string.Pol_EnableSMBQUIC_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_EnableSMBQUIC"
        valueName="EnableSMBQUIC"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy
        class="Machine"
        displayName="$(string.Pol_DisabledSMBQUICServerExceptionList_Name)"
        explainText="$(string.Pol_DisabledSMBQUICServerExceptionList_Help)"
        key="Software\Policies\Microsoft\Windows\LanmanWorkstation"
        name="Pol_DisabledSMBQUICServerExceptionList"
        presentation="$(presentation.Pol_DisabledSMBQUICServerExceptionList)"
        >
      <parentCategory ref="Cat_LanmanWorkstation"/>
      <supportedOn ref="SUPPORTED_Windows_Server_2025_Windows_11_0" />
      <elements>
        <multiText
            id="MultiText_DisabledSMBQUICServerExceptionList"
            valueName="DisabledSMBQUICServerExceptionList"
            />
      </elements>
    </policy>
  </policies>
</policyDefinitions>
